[
  "Commit ID: 0f8fba9575c7148afb086572f54c9e9db570cf8b\n\nOriginal Message: Update README.md\n\nPurpose: The purpose of this commit was to improve the readability and provide a more updated user instruction on README.md file. The content of the readme was reformatted to be clearer and more comprehensive for users.\n\nChanges: There have been additions and deletions in the README.md file. The main change was in the sections describing the intended uses of the system, where bulleted points have been added for easier digestion of information. Also, information related to the demo link and installation using virtual environment have been elaborated to help users better understand how to use the project.\n\nList of changes:\n* README.md -- This file was updated to refine the description of the system, expanded on the system's demo, and made the installation instructions more user-friendly. The revised file has a better format which aids in readers' comprehension.",
  "Commit ID: fabbfe76f07f668ea8b4502522dc2f401d4f19bd\nMessage: Fixed issue closes #46 (#52)\n\nPurpose: \nThis commit aimed to address issue #46. The issue likely had something to do with the improper session and term form handling in the file \"apps/corecode/views.py\". The improvement has streamlined the code and might have solved the error or bug associated with it.\n\nChanges:\nThe change in the file consists of simplifying the creation of form. The previous approach was a bit convoluted where the form was created with request.POST and initial instance. It was replaced by a more straightforward approach where the form is only created with request.POST, improving readability and maintainability.\n\nList of changes:\n\n* apps/corecode/views.py -- Streamlined form creation in \"post\" method of the CurrentSessionAndTermView class and removed unnecessary 'initial' attribute in form creation.",
  "Commit ID: d46659b8ea0c595b19432181a05501b507e9383e\nMessage: Resolved a bug with the empty student list in the student_list template.\n\nPurpose: The commit aimed to tackle an issue where a bug was happening in the student_list template when the student list was empty. This was an important fix because without this, the page could not display any data when the student list was empty, potentially having a negative user experience.\n\nChanges: A key change was made in the Django template language code in the student_list.html file. Namely, the iteration object was changed from 'object_list' to 'students', which indicates that there was probably a variable naming conflict or unreadable data before the modification.\n\nList of changes:\n* apps/students/templates/students/student_list.html -- The iteration object in the template has been changed from 'object_list' to 'students' to fix a bug where no students were displayed when the student list was empty.",
  "Commit ID: 90566e208afdc0b0c7f9fe3d0281c77590a423b7\nMessage: Merge pull request #49 from adigunsherif/dependabot/pip/django-3.2.17\n\nPurpose: The purpose of this commit was to update the Django version in the requirements.txt file from 3.2.15 to 3.2.17. This update may incorporate bug fixes, performance improvements, or new features from the newer version of Django.\n\nChanges: The only change in this commit was in the `requirements.txt` file, where the version of Django was updated.\n\nList of changes:\n* `requirements.txt` -- The version of Django was updated from 3.2.15 to 3.2.17.",
  "Commit ID: 39410767029a3d4bed82429535ad22e575945dc8\nMessage: Bump django from 3.2.15 to 3.2.17\n\nThe purpose of this commit was to update the Django version in the project from 3.2.15 to 3.2.17. This is most likely being done to make use of new features, improvements, or bug fixes that are included in the newer version of Django and overall improve the functionality of the project.\n\nOnly one file had changes: the requirements.txt file. \n\nChanges:\n* requirements.txt -- The version of Django specified in this file was updated from 3.2.15 to 3.2.17.",
  "Commit ID: d4b4da5ad0ce4cc09f60825fbb568e8a835b2e12\n\nMessage: Merge pull request #42 from adigunsherif/dependabot/pip/django-3.2.15. Bump django from 3.2.5 to 3.2.15.\n\nThe purpose of this commit was to manage dependencies of the project by increasing the version of Django (a high-level Python Web framework) from 3.2.5 to 3.2.15. This is likely a necessary step to implement new features, improve performance, or fix issues that are solved in the newer version of Django.\n\nIn this commit, several lines in the requirements.txt file were altered, to reflect the change in Django's version. Overall, there were less deletions than additions, suggesting new dependencies might have been introduced or additional specifications are provided for the existing ones along with the Django update.\n\nList of changes:\n* requirements.txt -- Changed the version of Django from 3.2.5 to 3.2.15. Minor changes to other dependencies might have been made as well.\n",
  "Commit ID: 7e4b34cb273519b90cd98329b3883b9dec8b880b\n\nMessage: \"Merge pull request #44 from adigunsherif/dependabot/pip/pillow-9.3.0: Bump pillow from 8.3.2 to 9.3.0\"\n\nPurpose: The purpose of the commit was to update the version of the pillow library from 8.3.2 to 9.3.0 in the requirements.txt file. This change was likely necessary to leverage new features, improvements, or bug fixes present in the newer version of pillow.\n\nChanges: Apart from other, unchanged library versions, the main change was an update of the pillow library version in the requirements.txt file.\n\nList of Changes:\n* requirements.txt -- The pillow library version was updated from 8.3.2 to 9.3.0.",
  "Commit ID: 4df6348b42d5036f074f23e04be59b788ff39f5c\nMessage: Bump pillow from 8.3.2 to 9.3.0\n\nPurpose:\nThis commit updates the version of the Pillow library dependency from 8.3.2 to 9.3.0 in the project. This update is mandatory and is generated by dependabot, which helps in keeping dependencies up-to-date and ensuring the project uses the most recent and secure versions. This can help avoid potential security vulnerabilities and bugs that could occur with older versions.\n\nChanges:\nThe version of Pillow in 'requirements.txt' has been changed from 8.3.2 to 9.3.0.\n\nList of changes:\n* requirements.txt -- Updated Pillow library version from 8.3.2 to 9.3.0.",
  "Commit ID: fc8ddfd5e1b45622bedf9d49f4a67686cf54ed2f\n\nMessage: Bump django from 3.2.5 to 3.2.15\n\nPurpose: The commit is an automated update made by dependabot to bump the django version being used in the project. The django version is updated from 3.2.5 to 3.2.15. This is to keep the project up-to-date with the latest django version which often includes new features, bug fixes, security fixes and other improvements.\n\nChanges: There are changes in one file, specifically the `requirements.txt` which records all the dependencies required for the project. The version of Django has been updated.\n\nList of changes:\n* `requirements.txt` -- The Django version has been updated from 3.2.5 to 3.2.15.\n",
  "Commit: f05ed7363280208d8f8dc7e3ff9737423fe15f33\nMessage: Merge pull request #33 from adigunsherif/adigunsherif-patch-2\\n\\nCorrects SiteConfigView fixes #28 closes #28\n\nThe purpose of this commit was to correct the issues with the SiteConfigView which has been addressed in fixes #28. The changes required to fix the issue involved updating the validation and context handling processes within the `get` and `post` methods of the SiteConfigView class. This was accomplished by updating the form handling logic to be more succinct and efficient.\n\nChanges:\nThere was a reduction in the total lines of code due to the simplification of the process. The context handling for the `get` and `post` methods were rewritten and simplified by reducing repeated code. Additionally, 'formset' variable has been renamed to 'form' to better reflect its usage.\n\nList of changes:\n* apps/corecode/views.py -- Updated the `get` and `post` methods of `SiteConfigView` to simplify the form and context handling. The form validation and save process were also updated in the `get` method. In the `post` method, the context now contains 'form' instead of 'formset'.",
  "Commit: 535c9d959971fe4df0e87ae794857ea858f10dd9\nMessage: Corrected variable name\nPurpose: The commit aimed to correct the inconsistency in the variable name used in the SiteConfigView class in the views.py file. This alteration aimed to reduce the likelihood of future bugs and improve the readability of the code by ensuring consistency in variable naming throughout the program.\n\nChanges: The changes involved switching variable names from \"formset\" to \"form\" in multiple instances within the SiteConfigView class. No modification to the functionality of the code has been implemented - these adjustments serve only to improve code consistency and readability.\n\nList of changes:\n* apps/corecode/views.py -- Changed variable \"formset\" to \"form\" in all instances within the SiteConfigView class.",
  "Commit: 1b4d823a2024a47909234e8dfd956a00c5f018ce\nMessage: Corrects SiteConfigView fixes #28 closes #28\nPurpose: The purpose of this commit was to correct the functioning of SiteConfigView. Previously, there had been issues with how SiteConfigView operates, which had led to problems captured under issues #28 on the project’s issue tracker. This fix was meant to address those problems and enhance the efficiency of SiteConfigView.\n\nChanges:\nThe major change involved in this commit was in the apps/corecode/views.py file. Specifically, the ‘get’ method within the SiteConfigView was modified. The original code which had extra context definition to render the form was removed, and the valid form was set to save and provide a successful update message, without an explicit redirection. The form rendering with context was moved to happen under the 'post' method.\n\nList of changes:\n* apps/corecode/views.py -- The get and post methods within SiteConfigView were refactored to enhance efficiency.",
  "Commit ID: 20fd127362b4664c075116a4e39c5d95fed32985\nMessage: Merge pull request #32 from adigunsherif/adigunsherif-patch-1 Create SECURITY.md Closes #31\n\nPurpose: This commit was made to incorporate a new SECURITY.md file into the project. This was done in accordance with an earlier pull request. This SECURITY.md file provides guidelines for reporting vulnerabilities, supported versions and discloses the process for issuing patches for confirmed vulnerabilities. \n\nChanges: The SECURITY.md file has been newly created and directly added to the project with this commit.\n\nList of changes:\n* SECURITY.md -- This new preventive security measures file has been created and added to include details about how to report vulnerabilities, the versions it supports, and the procedure for issuing a patch when a vulnerability is confirmed.",
  "Commit ID: 253b704c6dc2e6419d50bce1e8d2e89b4a0e332b\n\nMessage: Create SECURITY.md\n\nPurpose: The purpose of this commit was to add a SECURITY.md file to the project to clearly outline the project's security policy. This file informs users and contributors about which versions of the project are currently being supported and provides guidance on how to report a vulnerability. This enhancement was necessary to boost the project's transparency and credibility, reassure users about the project's commitment to security, and facilitate the process of reporting and addressing vulnerabilities.\n\nChanges: In total, one new file was added without any deletions. The added file is the SECURITY.md. This file outlines the project's approach to security, including which versions are supported, the process for reporting vulnerabilities, and the expected window for a response and a patch.\n\nList of Changes:\n* SECURITY.md -- A new file outlining the project's security policy was added. It offers guidance on reporting vulnerabilities and states that all versions of the project are currently supported. Suspected security vulnerabilities should be reported to adigunsherif@gmail.com, a response will be sent within 48 hours, and a patch will be released as soon as feasible.",
  "Commit ID: 18445ce74b3b8773a1f5cfc652d5f9d5001c97c5\nMessage: Merge pull request #30 from adigunsherif/dependabot/pip/sqlparse-0.4.2\nBump sqlparse from 0.4.1 to 0.4.2\n\nPurpose: The purpose of the commit was to update the version of the sqlparse library from 0.4.1 to 0.4.2. This update could contain essential bug fixes, improvements, and new features that will enhance the performance and stability of the project. It is crucial to keep the dependencies of a project up-to-date to leverage the latest improvements and avoid potential bugs and security vulnerabilities in older versions.\n\nChanges: The version of the sqlparse library was updated in the requirements.txt file.\n\nList of changes:\n* requirements.txt -- The sqlparse library version was updated from 0.4.1 to 0.4.2.",
  "Commit ID: b9e334aedce63d66e955dffac340b111436b4c39\n\nMessage: \"Bump sqlparse from 0.4.1 to 0.4.2\"\n\nPurpose: The purpose of the commit is primarily to update the version of the 'sqlparse' dependency used in the project from 0.4.1 to 0.4.2. The update may have introduced bug-fixes, security improvements, or new features which may improve the efficiency or safety of the code base.\n\nChanges: The commit made updates to the 'requirements.txt' file. The version of the 'sqlparse' dependency was updated from 0.4.1 to 0.4.2.\n\nList of changes:\n* requirements.txt -- In this file, the version of the 'sqlparse' library was updated from 0.4.1 to 0.4.2.",
  "Commit ID: 30aaa71d539455a628986c96359fefc580245168\n\nMessage: Merge pull request #29 from adigunsherif/dependabot/pip/pillow-8.3.2. Bump pillow from 8.3.1 to 8.3.2\n\nPurpose: The commit was aimed at upgrading the pillow library from version 8.3.1 to 8.3.2. Since the package is listed in the requirements.txt file, such an upgrade implies a necessary adjustment within the file. Upgrading could bring a range of benefits such as added features, optimization improvements, or most importantly security patches which might be critical for the functionality of any project using this package.\n\nChanges: The changes implemented in this commit are related to the dependent package 'pillow'. The version of this package has been upgraded from 8.3.1 to 8.3.2. This has been achieved by changing the version number in the 'requirements.txt' file where all the dependencies are listed.\n\nList of changes:\n* requirements.txt -- the Pillow dependency version got bumped from 8.3.1 to 8.3.2.",
  "Commit ID: bfb91fc89a3ddc5d6aeabf87cfa02cbf288579e2\n\nMessage: Bump pillow from 8.3.1 to 8.3.2\n\nPurpose: This commit was primarily created to update the version of the Pillow package from 8.3.1 to 8.3.2. This update was necessary to leverage new features, improvements and bug fixes that come with the newer version of the Pillow library, which is used for opening, manipulating, and saving many different image file formats in our application.\n\nChanges: The requirements.txt file was changed. The version of Pillow was updated in the requirements.txt file that lists all the dependencies for the project. The Pillow package version was changed from 8.3.1 to 8.3.2.\n\nList of changes:\n* requirements.txt -- Updated the Pillow package version from 8.3.1 to 8.3.2.",
  "Commit ID: 1225ebf067318501419068641a3808c0fc277bcf\nMessage: \"Adds tests for core models\"\n\nPurpose: The commit focuses on adding tests for core models in the Django School Management System. It is crucial from a development standpoint to maintain robust unit tests to ensure that the system's components are working as expected. It helps in identifying issues early in the development process, which leads to more efficient and reliable software. \n\nChanges: In this commit, a significant inclusion of tests in various models of the application was made. There was also a reorganization of the README file and updates made on how to perform tests.\n\nThe list of changes:\n* README.md -- Instructions on testing were moved;\n* apps/corecode/models.py -- Two import lines were added: \"from django.urls import reverse\" and \"from django.utils import timezone\";\n* The file was created with commit without a filename indicating the changes in additions and deletions was not provided;\n* apps/corecode/tests/__init__.py -- No changes were identified in this file;\n* apps/corecode/tests/test_models.py -- A good number of testing codes were added to the models; \n* apps/corecode/tests/test_views.py -- No changes were identified in this file as well.",
  "Changed function views to class based",
  "Updates project to follow Django coding standards",
  "Commit ID: 12e55805fdaea11820ffffca59c02e25f52dfd00\nMessage: closes #27; updates apps.py\n\nThe purpose of the commit was to enhance the code by refining the module reference names in the Django application files. The changes were made to ensure uniformity in module references across the application, leading to cleaner code and better maintainability.\n\nUpdates were mainly renaming changes along with the removal of the `DEFAULT_AUTO_FIELD` line in the school_app/settings.py.\n\nList of changes:\n* apps/result/apps.py -- The name 'apps.result' was replaced with 'result' in the AppConfig class;\n* apps/staffs/apps.py -- The name 'apps.staffs' was replaced with 'staffs' in the AppConfig class;\n* school_app/settings.py -- The 'DEFAULT_AUTO_FIELD' line was removed.",
  "refactor folder structures",
  "Commit ID: a27860aecdc6641030b8bbb81bb5512d589d8da4\n\nMessage: fix typo\n\nPurpose: This commit is for a simple typo fix that resulted in an inaccurate variable name, which if left unfixed, could have caused confusion or inconsistencies in the future development or debugging. \n\nChanges:\nA variable name was corrected from 'template' to 'template_name' in the IndexView class in the views.py file.\n\nList of changes:\n* corecode/views.py -- Changed the variable name from 'template' to 'template_name'",
  "Commit ID: efbd75c202e75a4ab234106b5466a08eae494c12\nMessage: fixed #21; fixed issue\n\nPurpose: The purpose of this commit was to fix the issue #21 related to the 'SubjectCreateView' class in ‘corecode/views.py’. There was a conflict in this portion which was resolved in this commit. Also, there were unwanted condition checks in the 'create_result' function in 'result/views.py', which were removed to improve the efficiency of the function.\n\nChanges:\nList of changes:\n* corecode/views.py -- Resolved a conflict located in 'SubjectCreateView', enhancing the functionality and readability of the respective section of code.\n* result/views.py -- Removed unnecessary conditional check for student's current class while fetching results in 'create_result' function, thereby making it more efficient.",
  "Commit ID: 90919148765c6477c32ac621e1ab82b0326de96e\nMessage: Merge branch 'master' of https://github.com/adigunsherif/Django-School-Management-System\n\nPurpose: The purpose of the commit was to merge changes from the 'master' branch of the Django School Management System project repository. This operation seems to have been performed to include recent updates or additions from the main branch into the active working branch.\n\nChanges:\nThe changes were made in the \"corecode/views.py\" file of the project. There has been adjustments in the SubjectCreateView class.\n\nList of changes:\n* corecode/views.py -- Merge conflict markers in the 'SubjectCreateView' class have been resolved by removing duplicate lines of code.",
  "Commit: b03e5860e9791b7931158fa504a814fd201e0e0c\nMessage: closes #22; Update views.py\nPurpose: The commit resolved issue number 22 which required an update in the views.py file. The",
  "Commit: 67ce4c2f0dc8af6170bd8a3761d86bf2b23fbbb2\nMessage: Add missing model parameters to view\n\nPurpose: \nThe point of this commit was to update the \"views.py\" file in the 'corecode' directory to include missing model parameters essential for the correct functioning of different aspects of the web application. In the original state, some view classes were lacking these model fields, and this was causing issues with rendering templates, form submission and data manipulations in general. Adding the missing model parameters ensures the application now appropriately handles requests and operations.\n\nChanges: \nThe 'views.py' file was changed, with five additions and ten deletions made in this commit. Essentially, the missing model parameters have been added to various create and update class views related to 'AcademicSession', 'AcademicTerm', 'StudentClass', and 'Subject'.\n\nList of changes:\n* corecode/views.py -- Missing model parameters added to SessionCreateView, TermCreateView, ClassCreateView, and SubjectCreateView. These parameters are vital for the correct functioning of these views.",
  "Commit ID: 30920c16cd3d3997e048865e120bb65be005aff0\nMessage: Updates on models\nPurpose: The commit was done to make some significant updates and modifications to the model files of the system. The changes are primarily focused on modifying the default values and ensuring the database elements are properly set to enhance the overall performance of the system.\n\nChanges:\nThere have been updates to five files, specifically those relating to the corecode, staffs and students. Many of these changes involve modifications to Django migration files and models.\n\nList of changes:\n* corecode/migrations/0004_auto_20201124_0614.py -- The file was entirely rewritten. The updates added a new Django migration altering the 'current' fields in the 'academicsession' and 'academicterm' models.\n* corecode/models.py -- The default value for 'current' fields in the 'AcademicSession' and 'AcademicTerm' models was changed from 'True' to 'False, null=True'.\n* staffs/migrations/0002_auto_20201124_0614.py -- The file was entirely rewritten. The updates added a new Django migration altering the 'mobile_number' field in the 'staff' model.\n* students/migrations/0002_auto_20201124_0614.py -- The file was entirely rewritten. The updates added a new Django migration altering the 'parent_mobile_number' field in the 'student' model.",
  "Merge branch 'aman2457-master'",
  "Merge branch 'master' of https://github.com/aman2457/Django-School-Management-System into aman2457-master",
  "'removed-registration-link,color-changes'",
  "Commit ID: 160f110fa51411822b23255b8a10a83e507f1cec\n\nMessage: updated gitignore\n\nPurpose: This commit was meant to update the .gitignore file. It seems like the author wanted to exclude certain files from being tracked by Git that were not previously specified. In addition to this, some changes were made in the Python configuration settings. \n\nChanges: In the .gitignore file, 3 lines were deleted and 1 line was added. A configuration file was also updated with additions of 4 lines and deletion of 1. \n\nList of changes:\n* .gitignore -- The file was updated by removing three specified paths and adding one new.\n* null (configuration file) -- This file appears to be a Python configuration setting, which was updated by adding four new lines and deleting one.",
  "Merge branch 'master' of https://github.com/aman2457/Django-School-Management-System into aman2457-master",
  "Commit ID: 05a4ad5882fd7fba8201451b3478f87a7d30e03e\nMessage: Update package versions in requirements.txt\nPurpose: The commit serves to update the versions of different packages listed in the requirements.txt file. The packages are integral to the smooth operation of the project, hence, the update could be to fix bugs, improve efficiency or add more functionality. Also, there has been a change to the .vscode/settings.json to point to a different path.\n\nChanges:\nThe changes in this commit include altering file paths and updating the versions of python packages:\n\nList of changes:\n* .vscode/settings.json -- The python path was adjusted from \"C:\\\\Users\\\\adigunsherif\\\\envs\\\\schoolapp\\\\Scripts\\\\python.exe\" to \"C:\\\\Users\\\\ADIGUN SHERIF\\\\envs\\\\school_app\\\\Scripts\\\\python.exe\"\n* requirements.txt -- Numerous packages had their versions updated, but the exact changes cannot be determined from the provided diff.",
  "\"update login page icon\"",
  "'added new login page'",
  "Commit: 381f8da0cfba9b466ef3f93ebbba4d0f57120adc\nMessage: Remove developer contact info \nPurpose: The purpose of this commit was to remove the developer contact information from the application. It likely was necessary to ensure privacy and prevent unnecessary contact from users of the application. As the project grows, it is important for the developer to delegate communication and troubleshooting tasks, maintaining contact information within the code itself can lead to an influx of direct user-to-developer communication which is not scalable.\n\nChanges:\nThe files changed in this commit included the corecode/urls.py and corecode/views.py files where paths and rendering potentially containing developer contact information were removed or altered. Additionally, one more file containing developer's contact details was entirely deleted.\n\nList of changes:\n* corecode/urls.py -- The URL for the developer page was removed. \n* corecode/views.py -- The function responsible for rendering the developer information page was moved higher up in the code.\n* null (developer contact details) -- The entire file containing developer's contact details was deleted.",
  "Commit: ceea44f9b1ece8da2cd974a79b80ef9765fecdb4\nMessage: \"Merge pull request #16 from RMPR/master\\n\\nFix errors in Run commands\"\n\nPurpose: The commit was made primarily to address some errors in the run commands. This was accomplished by altering a few sections of the code in the project files. \n\nChanges: \nThe changes made in this commit include correcting the spelling in the 'manage.py' run commands in README.md from 'manange.py' to 'manage.py'. Another change is the addition of a new navigation item in navigation bar in the file 'templates/base.html'. The item added is \"Developer\" as a link to a new developer page.\n\nList of changes:\n* README.md -- Corrected the spelling in the 'manage.py' run commands from 'manange.py' to 'manage.py'.\n* templates/base.html -- Added a new navigation item \"Developer\" in the navigation bar.",
  "Commit ID: edbe1543dc77de7e030c506228fd18048036bd5b\nMessage: Remove contributors mention\n\nPurpose:\nThe purpose of this commit was to remove the mention of 'Contributors' from the navigation in the user interface. The developers may have felt it was unnecessary for the mention to be there, or it might have been a design or business decision to remove it.\n\nChanges:\nIn the file \"templates/base.html\", a few alterations have taken place. The most notable change is the removal of a navigational link labelled 'developer'. This element has been completely deleted from the updated version of the file. Other minor changes include some reordering and modification of existing elements in the file, but these are incidental to the primary change.\n\nList of Changes:\n* templates/base.html -- Removed the navigation link termed 'Contributors'.",
  "Commit ID: bed8956202fbe0644bb480f583f51fc06e7df2a6  \nMessage: Fix errors in Run commands\n\nPurpose:  \nThe commit was aimed at correcting some erroneous spellings in the Run commands provided in the readme file of the project. The wrong commands would result in failure or unwanted behaviors when users copy and execute them.\n\nChanges:  \nThere were corrections in the \"Run\" command section of the project's readme file. Specific changes include corrections in the python manage.py commands where \"manange\" had been erroneously used instead.\n\nList of changes:\n* README.md -- 'manange' was corrected to 'manage' in the python commands for migrating the database and running the server.",
  "Commit ID: c5933b9802a4f6b1c9b64c44f58e018ab8faadf4\nOriginal commit message: \"updated todo.txt\"\n \nPurpose: The modification was made to improve the bulk invoice functionality and track project tasks. Enhancements were made to the finance module, particularly the bulk invoice section. One was for refactoring the HTML code to enable the display and submission of form data. Another was for enhancing the Python view function for the bulk invoice page. It now fetches all students' data and creates an initial formset from it while handling an HTTP POST request appropriately. Lastly, the todo list was updated to keep track of the progress and pending tasks for the project.\n\nChanges Made: \n* \"bulk_invoice.html\" file was modified to include form submit functionality.\n* In \"views.py\" file, the \"bulk_invoice\" function was revised to fetch and process student data.\n* The contents of the \"todo.txt\" file were updated with completed and new tasks.\n\nList of changes:\n* finance/templates/finance/bulk_invoice.html -- Updated to include form rendering and submission capability.\n* finance/views.py -- Modified the bulk_invoice view function to fetch all students and create an initial formset with the data.\n* todo.txt -- Updated to-do tasks in this file. Removed some completed tasks and added new ones.",
  "correct datatables folder",
  "Commit ID: 2354d8e8a9d436300f4950f4439aca6930c2ffa5\nMessage: Merge pull request #14 from sanjaypradeep/master - Phone number validation found missing in Staff App Module.\nPurpose: The purpose of this commit is to integrate the changes from pull request #14 where the team found a backend issue concerning phone number validation in the Staff App module. The validation was missing and thus allowed the input of non-valid phone numbers. Speedy action was needed to avoid complications originating from malformed data.\n\nChanges: The changes in the staffs/models.py file resulted in 13 lines added and 17 lines deleted. Phone number validation was reintroduced by adding a RegexValidator for the \"mobile_number\" field.\n\nList of changes:\n* staffs/models.py -- The RegexValidator has been added to properly validate mobile numbers and prevent invalid input.",
  "Commit ID: 62bbf289ee8aeb77083bd858a35a4e5c7ee35f8d\nMessage: Phone number validation under staff app. Found missing.\n\nPurpose:\nThe purpose of this commit is to include the phone number validation feature in the staff application. This feature was missing in the application earlier leading to inconsistent and incorrect input of phone numbers. As phone numbers are an important element for contact information, this validation is crucial to structure the input data correctly.\n\nChanges: \nThe primary change in this commit is in the 'staffs/models.py' file. Here, the phone number validation logic is included by calling the 'RegexValidator' for the 'mobile_number' field of the 'Staff' model. This RegexValidator is designed to accept numbers in a certain format. Specifically, it ensures that the phone number entered is numeric and within the length of 10 to 15 digits. If the entered format doesn't match the regex criteria, an error message is shown.\n\nList of Changes:\n* staffs/models.py -- Included 'RegexValidator' for the 'mobile_number' field in the 'Staff' model. Replaced the unrestricted 'mobile_number' field with a regex-validated field to ensure numerical inputs ranging from 10 to 15 characters in length.",
  "Commit ID: 9b896d9a171d397d5aa970a0d5ca517b88982a09\nMessage: Fix typos\nPurpose: The purpose of this commit was to correct a few typographical errors found in the content of the README.md file. These misspellings could potentially confuse or mislead those reading the document. Thus, they had to be rectified to improve clarity and accuracy of the information provided in the README.\nChanges: Small typo corrections in README.md file's content. Specifically, \"Enviroment\" is corrected to \"Environment\", and \"fledge\" was corrected to \"fledged\".\n\nList of changes: \n* README.md -- Typos fixed to improve the clarity of the instructions and description.",
  "Commit ID: 071e5dc30d4aa46dd1b0423d9efdcebe287237cb\n\nMessage: As per the discussion on size of mobile number field, changes are made and tested e2e as usual.\n\nPurpose: The purpose of this commit was to make adjustments to the restrictions on the mobile number field in the student model as per team discussions. The original regex expression only allowed for mobile numbers between 10 and 12 digits, but it was decided that this range did not cover all potential valid phone numbers. The regex validator for the mobile number has been updated to cater to these decisions.\n\nChanges: The RegexValidator for mobile numbers in the Student model has been adjusted to allow numbers between 10-15 digits instead of the previous 10-12 digits. This change has been adequately tested.\n\nList of changes:\n* students/models.py -- Adjusted the parameters for the RegexValidator used for mobile number validation. Specifically, it now checks for numbers of length 10 to 15 digits instead of 10 to 12.\n",
  "Commit ID: 4c1fac2afed85b74e7eba9ee7661c1dadff718e9\nMessage: Solution for #9 - added regex validation and structured with proper indentation and coding standard.\n\nPurpose: This commit was designed to enhance the codebase quality by addressing ticket #9. It involved introducing regex validation for student data and also improving the code formatting for better readability and adherence to coding standards. These changes are vital in ensuring that the application collects and processes valid data thereby improving the accuracy of its operations. Additionally, neat and standardized code formatting promotes code maintainability.\n\nChanges:\nThe changes involve the addition of validation based on regular expression and the structuring of code with correct indentation and in compliance with the coding standard. \n\nList of changes:\n* students/models.py -- The model for the student was adjusted with regex validation for mobile number field; and appropriate indentations were inserted for improved readability. The 'mobile_num_regex' attribute was removed and the 'parent_mobile_number' attribute no longer uses it for validation, suggesting that the regex implementation might have been modified or moved elsewhere. A good number of line changes are due to improved code indentation.",
  "Commit ID: 632fcf7efc03dcdadfbf2f7de07ee0d8b45ba916\nMessage: As per the discussion on size of mobile number field, changes are made and tested e2e as usual.\n\nPurpose: This commit was created to adjust the size of the mobile number field in the Student model. This change came as a result of a discussion about the appropriate size of the field. The adjustment was made to maintain consistency and validity in the data entered. Changes were tested end-to-end to ensure the updated code works as expected.\n\nChanges: The regex validator for mobile number in the Student model was adjusted. The valid mobile number length was changed from accepting 10-15 digits to only 10-12 digits.\n\nList of changes:\n* students/models.py -- The mobile number field validation has been changed to accept between 10-12 digits instead of the previous 10-15.",
  "Commit ID: 74aa9880e7b4d2eaaaab239e780fc135d4881553\nMessage: Solution for #9 - added regex validation and structured with proper indentation and coding standard.\n\nThe purpose of this commit is to implement a solution for the issue number 9. This involved introducing regular expression (regex) validation for specific data fields, and restructuring the code so that the indentation and coding standards adhere to the project's guidelines. The regular expression validation is designed to ensure data input into the system follows a specific format, cutting down on potential errors and enhancing the security of the overall system.\n\nThe primary change lies in the \"students/models.py\" file where 20 sections of code were added while 23 sections were removed or modified. The transformed code became easier to read and edit, and more compliant with standard Python syntax, making this change not just a bug fix, but a code optimization as well.\n\nList of Changes:\n* students/models.py -- This file has been changed substantially. The biggest change is the addition of regex validation, which ensures adherence to required data formats. Code has also been restructured according to the project's coding standards with improved indentation.",
  "**Commit ID:** 8c5f3048a870eba9315395e7db202696270b73c6   \n**Message:** Update core models  \n\nThe commit was purposed for various updates and cleanups in the project's core models and related files. This involves adjustments to how sessions and terms are handled and displayed in 'forms.py', simplified management of academic sessions and terms in 'models.py'. Furthermore, legacy migration file was deleted in this commit. Lastly, some redundant codes from 'views.py' were removed without affecting its functionality.\n\n**Changes:**\n\nList of changes:  \n* `corecode/forms.py` -- Updated help text for the 'current_session' and removed the help text for the 'current_term' field in 'CurrentSessionForm'.\n* `corecode/migrations/0003_auto_20200726_0925.py` -- Deletion of this file suggests that it contained obsolete migrations.\n* `corecode/models.py` -- Simplified boolean fields by removing the unnecessary 'default' and 'null' arguments.\n* `corecode/views.py` -- Removed 'get_context_data' method from the 'SessionCreateView' class which was not required.",
  "Commit: 270a9e4bf27d1c56b07211ddce9bdec141ad328d\nMessage: update templates\nPurpose: The commit aimed to update multiple templates. This appeared necessary to create a cleaner interface and to enhance the accessibility and user interface of some sections by making significant changes to the structure and presentation of data in the templates.\n\nChanges:\n\nList of changes:\n* finance/templates/finance/invoice_form.html -- Adjusted the layout of the invoice form, changing the structure of divs to better fit the layout requirements. These changes didn't affect the functionality of the form, they only aimed to make the frontend more appealing. \n* finance/templates/finance/invoice_list.html -- Reformatted the table layout for listing invoices. Removed redundant table deployment within a div class and streamlined the information presentation for enhanced user readability.\n* students/templates/students/student_list.html -- Reworked the student list presentation, removing table elements housed within an unnecessary div and subsequently simplifying the output. This will result in a more readable student list.",
  "Commit ID: 0fd445dff1f35e16060cd9c01d6f1719e0ba90af\nMessage: Update index.html\nPurpose: The purpose of this commit was to adjust the inheritance in the base template from 'base.html' to 'corecode/base.html'. This change is required for the structural organization of the templates for better maintainability and understanding of the codebase.\nChanges: The 'templates/index.html' file was altered. The line of `extends` in the file was changed.\n\nList of changes:\n* templates/index.html -- The base template that `index.html` was previously extending has been adjusted from 'base.html' to 'corecode/base.html'.",
  "Commit ID: bf0926f1534b6c7c589a0ecf4bd8e00886135a14\nMessage: update readme\nPurpose: This commit is aimed at updating the readme file of the project. The readme file gives detailed information about the project and any changes made will be to provide more information, correct errors or update some sections of the project's description based on the current status of the project\n\nChanges: The commit has reduced the size of the readme by removing certain information, particularly around the demo credentials, and made a few updates to the text.\n\nList of changes:\n* README.md -- The authentication credentials for the demo version of the application have been removed, reducing the overall size of the readme. Other minor text changes have been made.",
  "Commit ID: b9a338c662db07bc1fdbe2bc371f380e3a18474b\nMessage: updates on static files\n\nPurpose: The commit was made to update the settings related to static files in the Django application named \"school_app\". The changes streamline the configuration for storing static files, which are crucial for managing CSS, JavaScript, images, and other non-dynamic content in the Django web application.\n\nChanges: \nThe commit introduces the deletion of 7 lines and addition of 1 line in the \"school_app/settings.py\" file. The main changes are in the section handling configurations for static files, specifically in the \"STATIC_URL\", \"STATICFILES_DIRS\", and \"STATIC_ROOT\" configurations. These configurations dictate the handling of static files, their location, and storage in Django applications.\n\nList of changes:\n* school_app/settings.py -- Updated the configuration for static file handling. Specifically, the \"STATICFILES_DIRS\" and \"STATIC_ROOT\" settings were updated.",
  "Commit ID: 20ac9ea7aa08931012be3fe9a9073c559a999db3  \nMessage: Updates  \n\nPurpose: The purpose of the commit was to revert the version of Django used in the project from 3.0.8 to 3.0.7. This could be due to some incompatibility issues or bugs discovered with the later version.\n\nChanges: The 'requirements.txt' file was updated. The version of Django was downgraded from 3.0.8 to 3.0.7.\n\nList of changes:\n* requirements.txt -- Django version changed from 3.0.8 to 3.0.7.",
  "Commit: 5677bf0cc002f1ff990f7653e7e8ee22e50ed12f\nMessage: Merge pull request #8 from adigunsherif/revert-7-demo. Revert \"Demo\".\nPurpose: The goal of this commit was to revert the changes made in a previous demo by replacing the contents of several important project files. The files had to be changed back to their original form to undo the unintended consequences of the demo. This revert operation allowed for a clean environment for future, intentional changes.\n\nChanges:\n\nList of changes:\n* SECRET_KEY file -- The key has been changed, the details of this change are not specified;\n* .gitignore -- Two lines were added, while one line has been removed;\n* Unnamed file (possible script) -- Three lines were added, and seven lines have been removed;\n* requirements.txt -- The file had 6 lines added and 7 lines removed. Many new packages like gunicorn, psycopg2 and whitenoise were included, suggesting the possible move to a new environment;\n* school_app/settings.py -- The project settings file was significantly affected with 12 lines added and 8 lines removed. New configurations for secure key, host and Django settings were included, suggesting a possible shift in deployment environment.\n",
  "Commit ID: 94a93db602bf73c1798fe086fa2d4684f6723d6e\nMessage: Revert \"Demo\"\nPurpose: The goal of this commit was to revert from a previous update named \"Demo\". The reason for reverting could be that the changes made in the \"Demo\" commit either introduced errors, or were not suitable for the current stage of the project. \n\nChanges: \nSeveral changes were made in this commit. Files were updated to alter the way the secret key is handled, adding it to the environment variables for better security. The \".gitignore\" file and \"requirements.txt\" received additions. Additionally, the settings for the Django application in \"school_app/settings.py\" were adjusted to include the app's specific URL in the allowed hosts and to implement Django Heroku settings.\n\nList of changes:\n* Secret configuration file  -- secret key moved to environment variables for increased security;\n* .gitignore -- Added \".env\" line;\n* Release and web configuration files -- These files were added, containing commands for migrations and launching the app with gunicorn;\n* requirements.txt -- A few libraries were added (dj-database-url, gunicorn, psycopg2, python-dotenv, whitenoise);\n* school_app/settings.py -- The secret key reference was changed to os.environ.get('SECRET_KEY'), the allowed hosts have now included the herokuapp URL and the Django Heroku settings were implemented in this file.",
  "Commit: 02ad1cdba0e4bb469f6ceea7f42c0ffa1675aa85\nMessage: Merge branch 'master' of https://github.com/adigunsherif/Django-School-Management-System\nPurpose: This commit consolidates changes from the master branch of the Django School Management System. A range of changes were made across different files with the intent to update the codebase with the latest changes from the remote repository. \n\nChanges:\nThe general changes include the modification of existing files and the addition of new lines of code in others. The changes affect how the application handles environment variables and manages dependencies. In addition, there are adjustments to the project's settings. \n\nList of changes:\n* .env -- The secret key was added to this file, it was previously empty.\n* .gitignore -- Added rules to exclude certain file types including .env, log, pot, and pyc files, that were not excluded before.\n* Procfile -- This file was empty, but commands for migrating the database and starting the application server using gunicorn were added.\n* requirements.txt -- Added more dependencies to the requirements.txt file that were not previously included such as dj-database-url, gunicorn, psycopg2, python-dotenv, and whitenoise.\n* school_app/settings.py -- Changed the way the secret key is handled, allowed hosts settings, and removed usage of dotenv and django_heroku.",
  "updated template files",
  "Commit ID: 192ceaa6ac220b1e9b87680609f082c4dad49f0c \n\nMessage: Merge branch 'master' of https://github.com/adigunsherif/Django-School-Management-System \n\nPurpose: This commit represents a merge operation where the 'master' branch of the Django-School-Management-System from the remote repository has been merged with the local 'master' branch. This is necessary in order to sync the local 'master' branch with the updates that have been incorporated into the remote 'master' branch, thus ensuring that both codebases are aligned and consistent. \n\nChanges: Despite the merge operation, this commit has not introduced any changes to the files in the local repository. This might suggest that the local 'master' branch was already up-to-date with the remote one, or that any changes between the branches resulted in no conflicts that required resolution. \n\nList of changes:\nNo files were changed in this commit.",
  "Commit: aa25a7f5b38f9aea1c81df53d50acc1985359a0f\nMessage: Merge pull request #7 from adigunsherif/demo\n\nPurpose: This commit was made to merge the changes from the 'demo' branch into the main branch. The changes primarily involve the update of the .env and .gitignore files, and updates in the application's settings in settings.py. This was necessary to protect sensitive data, by ignoring the .env and refining the .gitignore file, and adapting the application's settings for better functionality based on the new modifications.\n\nChanges: \nThere were updates to five files, namely on:\n* .env -- addition and deletion of data for environment variables;\n* .gitignore -- refinements in the prescribed files to ignore;\n* Procfile -- addition and removal of commands for the application's operation;\n* requirements.txt -- alterations regarding the application's dependencies;\n* school_app/settings.py -- adaptation of the application's settings file, including security, cached files, and allowed hosts.\n\nList of changes:\n* .env -- Secret key has been added and corresponding deletions were made.\n* .gitignore -- '.env' has been added to the list of files to ignore for protection of sensitive data, with corresponding deletions of unnecessary entries.\n* Procfile -- New buildpack commands were added for the application's release phase on Heroku, while unnecessary commands were removed.\n* requirements.txt -- Additions of new dependencies that are necessary for the application, and removal of the old, irrelevant ones.\n* school_app/settings.py -- Changes for the security key, allowed hosts and elimination of unnecessary command for loading the environment variables were made for better compatibility with the new changes.",
  "Commit ID: f8df1f6680d810baf4c708eb667bde2f8f818f4b\nMessage: Merge pull request #7 from adigunsherif/demo\n\nPurpose: The commit aims to merge pull request #7, labeled as \"Demo\". The changes highlight the overall adjustment of some environment settings and requirements for the project. It seems to be a part of the project cleanup and optimization routine, tending towards better performance and secure management.\n\nChanges:\nA brief summary of the changes include updating the value of SECRET_KEY and specifying the ALLOWED_HOSTS. New additions were made to the project's requirements. \".env\" and \"procfile\" files were added. \n\nList of changes:\n* .env -- Secret key value was updated.\n* .gitignore -- File was changed with the removal and addition of ignore settings.\n* Procfile -- The file was added and specified commands on executing the project.\n* requirements.txt -- Several dependencies were added into the project.\n* school_app/settings.py -- Settings for the project have been updated, including making SECRET_KEY static and ALLOWED_HOSTS empty.",
  "Commit ID: ccb9d77a8b244e5bcc4a54e08b200486c5bcb7a9\nMessage: Merge branch 'demo' of https://github.com/adigunsherif/Django-School-Management-System into demo\n\nPurpose: This commit is a merge from a different branch called 'demo'. It was meant to update the 'requirements.txt' file associated with the Django School Management System project, to align it with the latest changes done in the 'demo' branch and improve overall project consistency.\n\nChanges:\nIn this commit, the \"requirements.txt\" file has been updated. There was one addition and six deletions made to this file. The exact differences show Django==3.0.7 being removed from the old file and added to the new file, likely representing an update of the Django version utilized in the project.\n\nList of changes:\n* requirements.txt -- Django 3.0.7 was removed from the original file and appended to the updated version, symbolising an upgrade or correction in the version of Django being used for the project.",
  "Commit ID: 3d37d4f5c9ffabece9a2a1c802fa95143c44cf5d\nMessage: Updates\nPurpose: The commit was intended to update the Procfile, a file used in Heroku deployment for specifying the commands that are executed by the app on startup. Previously, the Procfile was empty and hence no commands would have been run, creating problems at the time of deployment. By adding the necessary commands, its functionality has been restored and the application should run properly after deployment.\n\nChanges: \nThe main change in this commit was the addition of 2 commands to the Procfile, which was previously empty.\n\nList of changes:\n* Procfile -- Added 2 commands, namely: \"release: python manage.py migrate --noinput\" and \"web: gunicorn school_app.wsgi --log-file -\" which are necessary for running the application on startup.",
  "Merge branch 'master' into demo",
  "updated template files",
  "Commit ID: 08dcdb7a610e74e08f25ef77c94d453c52fc22bf\nMessage: Merge branch 'master' of https://github.com/adigunsherif/Django-School-Management-System\nPurpose: The commit was designed to merge the latest changes from the remote master branch into the current local branch. This enables both versions of the project to be synchronized and ensures that the most recent updates from other contributors are included in the local project. The changes also included an update to the project's dependencies.\n\nChanges:\nThe 'requirements.txt' file, which lists the project's Python dependencies, saw a number of modifications. The old version of Django was updated to a new one, which implies that the project now utilizes the newer, more secure, and more efficient version. The change may have been necessary to take advantage of new features, improved performance, or bug fixes provided by the newer Django version. \n\nList of changes:\n* requirements.txt -- Updated Django version from 3.0.5 to 3.0.7.",
  "general updates",
  "Commit ID: 5372dbd2611d4951e30b121f15272816e234efb1\nMessage: Update requirements.txt\nPurpose: The purpose of this commit was to update the dependencies of the project. Adjusting the version of Django for compatibility or desired feature purposes. It is crucial to manage accurately the version of the dependencies to assure the project works as expected.\n\nChanges: This commit resulted in the downgrade of Django from version 3.0.7 to 3.0.5.\n\nList of changes:\n* requirements.txt -- Django has been downgraded from version 3.0.7 to 3.0.5.",
  "Commit Id: a7906e9829ece50863f70c67a35057b1514c9b88\n\nMessage: Merge pull request #6 from adigunsherif/dependabot/pip/django-3.0.7 Bump django from 3.0.5 to 3.0.7\n\nPurpose: The purpose of this commit was to update the Django dependency. A newer version of the Django framework was made available, version 3.0.7, which the author decided to incorporate into this project, replacing the previous version, Django 3.0.5. This update is expected to bring bug fixes, better performance, and potential new features from the Django team, thereby improving the overall functionality and robustness of the project.\n\nChanges: The old Django 3.0.5 version was replaced with the new 3.0.7 version in the requirement.txt file, which specifies the packages needed to run this project.\n\nList of changes:\n* requirements.txt -- This file has been updated, the Django framework version has been changed from 3.0.5 to 3.0.7.\n",
  "Commit ID: b50aa7452a51cc02c35c6989a4d3d8021a1f8943\n\nMessage: Bump django from 3.0.5 to 3.0.7\n\nPurpose: This commit primarily serves to update the version of Django used in the project. Django, being the core framework of the application, ensures the smooth running of the app and its features. The update from version 3.0.5 to 3.0.7 implicates important bug fixes, security patches and performance improvements in the Django project.\n\nChanges: Django version was updated from 3.0.5 to 3.0.7 in the project's dependencies.\n\nList of changes:\n* requirements.txt -- Django version was changed from 3.0.5 to 3.0.7.",
  "Commit: a6fe25ad3a67dcf751444a3794d17f126120b71d\nMessage: Added settings\n\nPurpose: The purpose of this commit was to resolve a merge conflict concerning the setting of 'LOGIN_REDIRECT_URL', 'LOGOUT_REDIRECT_URL', and 'django_heroku.settings' in the file 'school_app/settings.py'. The differences were related to the placement of 'django_heroku.settings' above or below the defined URL settings. This merge conflict had to be addressed to ensure consistent behavior of the application. \n\nChanges: A line calling 'django_heroku.settings' has been moved to end of the file and the setting of 'LOGIN_REDIRECT_URL' and 'LOGOUT_REDIRECT_URL' was moved before the aforementioned line. This is reflecting the setting hierarchies and dependencies among those.\n\nList of changes:\n* school_app/settings.py -- resolved merge conflict concerning the placement of 'django_heroku.settings' and URL settings.",
  "Merge branch 'master' into demo",
  "Added authentications",
  "Commit: 2ff1947e9bd52900ee1216b88af53b6034f75030\nMessage: Updated README\nPurpose: The aim of this commit was to update the README.md to make it more informative and current. The author felt it necessary to include a link to a live demo of the Django School Management System which is updated each time the demo branch is updated. This demo link is helpful to potential users who might want to see the application in action before cloning and installing it on their local environment.\n\nChanges:\nThe README.md file has been updated with a new section named 'Demo'. The purpose of this section is to inform users that a live demo of the application is available for viewing and usage. This demo is updated in tandem with the updates to the demo branch of the code base. In addition to the new section, some comments in the 'Usage' section got removed.\n\nList of changes:\n* README.md -- Added 'Demo' section and removed some lines from 'Usage' section.",
  "Commit ID: 1ee5acea0e758b50496f5a2d97e7d5f18f9824bf\nMessage: update profile\nPurpose: The commit was made to update the profile section of the application. The changes made in the release process were meant to ensure that the database migration occurs seamlessly with no input required from the user.\nChanges: There were changes made to the \"Procfile\" where an addition was made while 8 lines were deleted. \nList of changes:\n* Procfile -- One line was added: `release: python manage.py migrate --noinput` and the entire previous file content has been retained. It appears the old version of the file didn't contain the database migration command in the release process. This change ensures that the migration takes place automatically without any user input.",
  "updated gitignore",
  "Commit ID: b8c0b37e472e2cf1c05681e74c988b1b024b6e81\nMessage: Added gunicorn\nPurpose: The purpose of this commit was to include the gunicorn package into the project dependencies. It appears that gunicorn, a HTTP server for Python web applications, was left out in the previous versions of the requirements file. \n\nChanges: \nThe commit involves the addition of gunicorn to the requirements.txt file. This file has been updated to include gunicorn as one of the necessary packages needed for the project. It seems there are also some deletions in the file, reducing the number of dependencies needed for the project to run successfully.\n\nList of changes:\n* requirements.txt -- Gunicorn was added to the list of necessary packages. Certain unnecessary packages were removed, hence reducing the project's dependencies from a previous count.\n",
  "Commit: 102b47c20ba80f0dfb91484f5fece230521921f3\nMessage: \"update gitignore\"\nPurpose: The purpose of this commit is mainly to reposition the entry '.env' in the .gitignore file under the Django section. This is likely for better organization and clarity of which environment files to exclude in a Django project context.\n\nChanges: The commit involves the modification of one file (.gitignore). Specifically, this modification is about removing the '.env' entry from the bottom of the file and adding it back under the Django section. \n\nList of changes:\n* .gitignore -- '.env' entry has been relocated from the bottom of the file to under the Django section.\n",
  "added db",
  "Commit id: 39e8a3ca39e643d0e40da58be2ef07286b856d33\nMessage: settingsupdated\n\nPurpose: \nThe purpose of this commit is to update the settings of the application, specifically focusing on the configuration of the allowed hosts in the Django 'settings.py' file. The developer made this change to ensure that the website could function correctly on the new host URL by adding a trailing slash to the end of the URL.\n\nChanges: \nThe changes involved an alteration in the \"ALLOWED_HOSTS\" setting in the 'settings.py' file, with a trailing slash added to the given host URL.\n\nList of changes:\n* school_app/settings.py -- The allowed hosts list was updated with the current host URL appended with a slash at the end.",
  "Commit ID: 51dc8444cc0683e864b3e5a6ae88e761f6ad12c2\nMessage: \"Added dotenv\"\nPurpose: This commit was aimed at incorporating the 'dotenv' module into the project. 'dotenv' allows for easier handling of environment variables, making the application's configuration more flexible and secure. The pre-existing dependencies were trimmed down for maintenance and efficiency.\n\nChanges: The 'requirements.txt' file has been revised. The 'dotenv' module has been added to the file, while six other unneeded dependencies were removed.\n\nList of Changes:\n* requirements.txt -- Added the dotenv module and removed six other dependencies.",
  "Commit: ac3572d3dc4d936ca0fe99e52f41ac01eca25d8f\nMessage: Update settings.py\nPurpose: The purpose of this commit was to update the settings within the Django web application. This involved changing how the secret key is managed, removing the dotenv functionality, modifying the ALLOWED_HOSTS setting, and adjusting the overall structure of the settings.py file. These changes might have been made to improve the security and efficiency of the application.\n\nChanges:\n* The .env file was edited with the SECRET_KEY setting being removed.\n* The school_app/settings.py file was significantly altered:\n  - The SECRET_KEY value was hardcoded instead of being extracted from an environment variable.\n  - The dotenv setup was removed.\n  - The ALLOWED_HOSTS setting was emptied.\n* An undefined file with similar content to school_app/settings.py was added.\n\nList of changes:\n* .env -- Removed SECRET_KEY setting.\n* school_app/settings.py -- Hardcoded SECRET_KEY value, removed dotenv setup, and modified ALLOWED_HOSTS setting.\n* Undefined file (similar to school_app/settings.py) -- File was added.",
  "Commit ID: 7f25080e7f08f693021825aee368498bb90116f9\nMessage: Added django-heroku\nPurpose: The purpose of this commit was to add Django Heroku to the project. Django Heroku is a set of powerful configurations and integrations to allow the Django framework to work seamlessly on Heroku, an application platform. It looks like these Django Heroku integrations have been added in two different files.\n\nChanges:\n* Changes were made to two files and one file was removed.\n\nList of changes:\n* requirements.txt -- Django Heroku and several other dependencies were added to the requirements file. The additions of these packages suggest they are necessary for current functionalities of the application.\n* school_app/settings.py -- The django-heroku import statement was added to Django's settings, which suggests the Heroku configurations will be used throughout the Django project.\n* school_app/settings.py.468dc49f8c1374af156260a42dd96637.py -- This file was removed from the project. The fact that it shares a name with an existing configuration file in Django (settings.py), implies that the information it contained may have been migrated over to the main settings file.",
  "Commit ID: 814727bf46dd2b60dd51693dd4db525e2fe1a779\nMessage: Added Procfile for Heroku deployment\nPurpose: The purpose of this commit was to add a Procfile necessary for the Heroku deployment of the project. This file allows Heroku to know how to correctly start the application, in this case via the Gunicorn web server. Without this file, the project would not deploy correctly on Heroku.\n\nChanges:\nThe main change was the addition of the Procfile.\n\nList of changes:\n* Procfile -- This file was added to the project to facilitate the deployment on Heroku. It directs Heroku to use Gunicorn as the HTTP server for the application.",
  "Commit ID: dbbd3d01d3541c383f8e64d8ab0c15541764f677\nMessage: \"Update dashboard\"\n\nPurpose: The purpose of the commit is to improve the layout and content of the main dashboard of our application by updating a number of Django files in the app. \n\nChanges: The commit involved a significant amount of content reorganization across multiple Python and Django based files. Most updates involved the removal of an extra line space between import code and comments. Additionally, changes were made to the school_app/settings.py file and the corecode/templates/corecode/index.html file.\n\nList of changes:\n* app_users/__init__.py -- No content changes;\n\n* app_users/admin.py -- Removed an extra line space between import statement and subsequent comment;\n\n* app_users/apps.py -- Removed an extra line space between import statement and subsequent class definition;\n\n* app_users/migrations/__init__.py -- No content changes;\n\n* app_users/models.py -- Removed an extra line space between import statement and subsequent comment;\n\n* app_users/tests.py -- Removed an extra line space between import statement and subsequent comment;\n\n* app_users/views.py -- Removed an extra line space between import statement and subsequent comment;\n\n* corecode/templates/corecode/index.html -- Removed unnecessary line spaces and updated content inside the 'content' block;\n\n* school_app/settings.py -- Removed 'app_users' reference from the INSTALLED_APPS list in the Django settings.",
  "Commit ID: 2b58dfc983fd73944a6fb2632e7ac7cd1af5bd7f\nMessage: Re-arrange static folder\n\nPurpose:\nThe purpose of this commit is predominantly to organise the code better and make it more maintainable in future. The author has re-arranged the static folder to enhance code readability and orderliness. No major functionality updates or modifications have been made, but the change simplifies the code structure.\n\nChanges:\nThere are several files where the locations have been changed but no code has been removed or added. Additionally, in the file 'corecode/templates/corecode/base.html', there are a few replacement of DataTables paths.\n\nList of changes:\n* corecode/static/plugins/Datatables/datatables.css -- location/path of file has been changed but file's contents remain intact.\n* corecode/static/plugins/Datatables/datatables.js -- location/path of file has been changed but file's contents remain intact.\n* corecode/static/plugins/Datatables/datatables.min.css -- location/path of file has been changed but file's contents remain intact.\n* corecode/static/plugins/Datatables/datatables.min.js -- location/path of file has been changed but file's contents remain intact.\n* corecode/templates/corecode/base.html -- various references to DataTables have been updated along with location/path of the file has been changed.",
  "Commit ID: 64252b2f3bcfc6e0391e999e56803eef8904a3cf\nMessage: Updated README\nPurpose: The commit was made to update the README file of the Django-School-Management-System project. The changes were needed to offer more accurate information. Incorrect directory change instruction \"cd newapp\" was switched to \"cd Django-School-Management-System\", improving guidance for users who want to clone the repository. Additionally, the command for installing required packages was reinserted to ensure all necessary tools are installed before running the application.\nChanges: There were 2 additions and 10 deletions to the README.md file to reflect the corrected information.\nList of changes:\n* README.md -- The directory change instruction was corrected from \"cd newapp\" to \"cd Django-School-Management-System\". Furthermore, the command \"pip install -r requirements.txt\" for installing required packages was restored.",
  "Commit ID: ba3ebcdddea1c97d71f26a4d1d319bc4489a0fb8\nMessage: Change project name to school_app\nPurpose: This commit was dedicated to changing the project name \"newapp\" to \"school_app\". Instead of one generic project name that does not provide any contextual meaning, the project is now made more representative of its purpose; a school application.\n\nChanges:\nIn this commit, changes pertain primarily to the project's identifiers in the settings and main files. The old project name \"newapp\" was swapped out in favour of the new name \"school_app\". No other major changes were made, except for renaming the project.\n\nList of changes:\n* manage.py -- The default Django settings module was changed from 'newapp.settings' to 'school_app.settings'.\n* school_app/settings.py -- The project settings were updated, replacing 'newapp' instances with 'school_app'.\n* school_app/wsgi.py -- The default Django settings for WSGI application was updated from 'newapp.settings' to 'school_app.settings'.",
  "Commit ID: d33da6a2646b955a212a3346e94551676f201d3c\nMessage: Update Readme\nPurpose: The commit was intended to make modifications to the project's README.md file and eliminate redundancies in the staffs/views.py file. More specifically, the Readme file was streamlined, with 17 lines deleted and four new lines added. This was presumably done to make the instructions more succinct and easy to follow. In the staffs/views.py, an import redundancy was noticed; hence, an unnecessary import statement was removed.\nChanges:\nList of changes:\n* README.md -- Streamlined the documentation with 17 lines of instructions removed and four new lines added to make it more succinct.\n* staffs/views.py -- Removed a redundant import statement for \"DetailView\" from django.views.generic, which had been imported twice.",
  "Commit ID: 3fa1098fcd024944ddd2eb583ec52e5786086ad2  \nMessage: Update README and add LICENSE.txt\n\nPurpose: The intention of the commit was to tidy up the README document and ensure that it had clear and concise documentation for ease of understanding. The commit also introduced a LICENSE.txt file to clearly outline the permissions associated with the use of this software. These changes help to provide clear instructions and legal permissions for the use of the software, improving its user-friendliness and accessibility.\n\nChanges: As part of this commit, the formatting and organisation of the README file were significantly improved, with redundant information being removed and vital details being retained in a more readable manner. Secondly, a LICENSE.txt file was added, providing the MIT license details of the software.\n\nList of changes:\n* LICENSE.txt -- The MIT License was added to this project, with all the associated copyright notice, permission notice, and the warranty disclaimer details.\n* README.md -- The documentation was revised for clearer readability. The changes improved conciseness and made the purpose of the software much more understandable. The format was also changed to a more neat and readable format.",
  "Added core static files",
  "Commit ID: 96c48283dfc1f29290a40006c4ef1f8afdee0e66\nMessage: Update Readme\nPurpose: The commit was necessary for updating the README file to provide a more detailed explanation of the Django School Management System. It was important to clarify that the application is designed for school managers to handle administrative tasks like managing school records - student data, staff, results, and finances, and doesn't support staff/student login.\n\nChanges: The main change included in this commit was the addition of important information about the application on the README.md file. The elaboration provided sheds light on who the application's intended users are and its functionalities. Also, some unnecessary repetitions were removed.\n\nList of changes:\n* README.md -- The file was updated with more detailed information about the Django School Management System and its functionalities. Additionally, repeated information was removed.",
  "Updated results",
  "updated results",
  "updated codebase, added results model",
  "Commit ID: ce91348a46ea669a7a835f1ab358c87ccf04ce04\nMessage: corrected upload template\nPurpose: This commit was made to correct the students upload template. The previous code did not completely represent the required fields and behavior of the upload form leading to an incomplete form layout. To fix this, several lines of code have been added to include instructions on uploading a CSV file and to declare the needed fields.\n\nChanges: \nThe upload form template 'students/templates/students/students_upload.html' has changed significantly. There were 31 lines of code deleted, and 6 new lines added for further enhancement and correction.\n\nList of changes:\n\n* students/templates/students/students_upload.html -- Introduced instructions to guide the user while uploading a CSV file. The required fields such as registration number, surname, firstname, other names, gender, parent number, and address have been explicitly mentioned for clarity. This inclusion will aid users in preparing the CSV file correctly before uploading.",
  "Added CSV student upload",
  "added invoice",
  "Commit ID: 72d728a35328f6ab066eddc93b6eb43bbebbc3f7\nMessage: \"initial commit\"\n\nPurpose: This commit signifies the creation of the project. In other terms, it is the first commit when the repository was initially set up. As such, there are no file changes associated with this commit because it marks the 'beginning'. Its main purpose is to generate the project structure, setup initial configurations and prepare the files for further development.\n\nChanges: There are no changes made as this is the initial commit for the project.\n\nList of Changes:\n* No file changes."
]